#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_kuro-mar-07-b-ce-id-business-test-6371.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      - client_id       = "3eab4400-f036-402f-9520-9519d402bdc1" -> null
      - config          = {
          - "access.token.claim"         = "true"
          - "access.tokenResponse.claim" = "false"
          - "claim.name"                 = "identity_provider"
          - "id.token.claim"             = "true"
          - "jsonType.label"             = "String"
          - "user.session.note"          = "identity_provider"
        } -> null
      - id              = "b32a35c5-9a14-488b-a6e1-98466afc30e3" -> null
      - name            = "IDP" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usersessionmodel-note-mapper" -> null
      - realm_id        = "onestopauth-business" -> null
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_kuro-mar-07-b-ce-id-business-test-6371.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      - client_id       = "3eab4400-f036-402f-9520-9519d402bdc1" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "idir_guid"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "idir_guid"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "85452863-d1ff-47a3-baba-ec0a47525f34" -> null
      - name            = "idir_guid" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth-business" -> null
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_kuro-mar-07-b-ce-id-business-test-6371.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      - client_id       = "3eab4400-f036-402f-9520-9519d402bdc1" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "idir_userid"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "idir_userid"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "035260ee-343d-404c-88cb-4b410fa17767" -> null
      - name            = "idir_userid" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth-business" -> null
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_kuro-mar-07-b-ce-id-business-test-6371.keycloak_openid_client.this will be destroyed
  - resource "keycloak_openid_client" "this" {
      - access_type                              = "CONFIDENTIAL" -> null
      - client_id                                = "kuro-mar-07-b-ce-id-business-test-6371" -> null
      - client_secret                            = (sensitive value)
      - consent_required                         = false -> null
      - description                              = "CSS App Created" -> null
      - direct_access_grants_enabled             = false -> null
      - enabled                                  = true -> null
      - exclude_session_state_from_auth_response = false -> null
      - full_scope_allowed                       = false -> null
      - id                                       = "3eab4400-f036-402f-9520-9519d402bdc1" -> null
      - implicit_flow_enabled                    = false -> null
      - name                                     = "kuro-mar-07-b-ce-id-business-test-6371" -> null
      - realm_id                                 = "onestopauth-business" -> null
      - service_accounts_enabled                 = false -> null
      - standard_flow_enabled                    = true -> null
      - valid_redirect_uris                      = [
          - "http://bceidDev.com",
          - "http://devchange.com",
        ] -> null
      - web_origins                              = [] -> null
    }

  # module.keycloak_prod.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "kuro-mar-07-b-ce-id-both-test-6372"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_prod.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_prod.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_prod.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_prod.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "kuro-mar-07-b-ce-id-both-test-6372"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_prod.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.display_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "display_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "display_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "displayName"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "display_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_prod.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_prod.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_prod.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_prod.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "kuro-mar-07-b-ce-id-both-test-6372"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "kuro-mar-07-b-ce-id-both-test-6372"
      + realm_id                                 = "onestopauth-both"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://prodtest.com",
        ]
    }

  # module.keycloak_test.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
      ~ access_type                              = "PUBLIC" -> "CONFIDENTIAL"
        id                                       = "9f2cf24a-37c6-49d3-bcf9-584542649d90"
        name                                     = "kuro-mar-07-b-ce-id-both-test-6372"
      - pkce_code_challenge_method               = "S256" -> null
      ~ valid_redirect_uris                      = [
          + "http://testchange.com",
            # (1 unchanged element hidden)
        ]
      ~ web_origins                              = [
          - "+",
          - "http://bceidTest.com",
        ]
        # (11 unchanged attributes hidden)
    }

  # module.keycloak_test.module.onestopauth_business.module.client_kuro-mar-07-b-ce-id-business-test-6371.keycloak_generic_client_protocol_mapper.access_token_aud will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      - client_id       = "2a8d39a5-91ad-4700-99ce-32905ea0de8b" -> null
      - config          = {
          - "access.token.claim"       = "true"
          - "id.token.claim"           = "false"
          - "included.client.audience" = "kuro-mar-07-b-ce-id-business-test-6371"
        } -> null
      - id              = "9dd827e0-46bd-44d7-8dae-aa9f54adaa05" -> null
      - name            = "access_token_aud" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-audience-mapper" -> null
      - realm_id        = "onestopauth-business" -> null
    }

  # module.keycloak_test.module.onestopauth_business.module.client_kuro-mar-07-b-ce-id-business-test-6371.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      - client_id       = "2a8d39a5-91ad-4700-99ce-32905ea0de8b" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "bceid_business_guid"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "bceid_business_guid"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "a9b107af-287a-4d0f-9ced-13bac959f716" -> null
      - name            = "bceid_business_guid" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth-business" -> null
    }

  # module.keycloak_test.module.onestopauth_business.module.client_kuro-mar-07-b-ce-id-business-test-6371.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      - client_id       = "2a8d39a5-91ad-4700-99ce-32905ea0de8b" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "bceid_business_name"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "bceid_business_name"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "fd955a22-4a59-4744-82a5-6f09af291b9c" -> null
      - name            = "bceid_business_name" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth-business" -> null
    }

  # module.keycloak_test.module.onestopauth_business.module.client_kuro-mar-07-b-ce-id-business-test-6371.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      - client_id       = "2a8d39a5-91ad-4700-99ce-32905ea0de8b" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "bceid_userid"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "bceid_userid"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "2e95a8fc-dfbb-4130-a28f-1d8597db00a2" -> null
      - name            = "bceid_userid" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth-business" -> null
    }

  # module.keycloak_test.module.onestopauth_business.module.client_kuro-mar-07-b-ce-id-business-test-6371.keycloak_generic_client_protocol_mapper.client_roles_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      - client_id       = "2a8d39a5-91ad-4700-99ce-32905ea0de8b" -> null
      - config          = {
          - "access.token.claim"                   = "true"
          - "claim.name"                           = "client_roles"
          - "id.token.claim"                       = "true"
          - "jsonType.label"                       = "String"
          - "multivalued"                          = "true"
          - "userinfo.token.claim"                 = "true"
          - "usermodel.clientRoleMapping.clientId" = "kuro-mar-07-b-ce-id-business-test-6371"
        } -> null
      - id              = "4a6dec33-e3b4-4fc8-b912-0c99d5e12d69" -> null
      - name            = "client_roles" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-client-role-mapper" -> null
      - realm_id        = "onestopauth-business" -> null
    }

  # module.keycloak_test.module.onestopauth_business.module.client_kuro-mar-07-b-ce-id-business-test-6371.keycloak_generic_client_protocol_mapper.display_name_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "display_name_mapper" {
      - client_id       = "2a8d39a5-91ad-4700-99ce-32905ea0de8b" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "display_name"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "displayName"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "9dd30bff-46d7-407b-b99b-1ba83512c4a8" -> null
      - name            = "display_name" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth-business" -> null
    }

  # module.keycloak_test.module.onestopauth_business.module.client_kuro-mar-07-b-ce-id-business-test-6371.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      - client_id       = "2a8d39a5-91ad-4700-99ce-32905ea0de8b" -> null
      - config          = {
          - "access.token.claim"         = "true"
          - "access.tokenResponse.claim" = "false"
          - "claim.name"                 = "identity_provider"
          - "id.token.claim"             = "true"
          - "jsonType.label"             = "String"
          - "user.session.note"          = "identity_provider"
        } -> null
      - id              = "da6f2736-e5de-46bc-98ae-f7b0e732d88d" -> null
      - name            = "IDP" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usersessionmodel-note-mapper" -> null
      - realm_id        = "onestopauth-business" -> null
    }

  # module.keycloak_test.module.onestopauth_business.module.client_kuro-mar-07-b-ce-id-business-test-6371.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      - client_id       = "2a8d39a5-91ad-4700-99ce-32905ea0de8b" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "idir_guid"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "idir_guid"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "49941b31-1499-4114-9eb3-0a771dee6663" -> null
      - name            = "idir_guid" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth-business" -> null
    }

  # module.keycloak_test.module.onestopauth_business.module.client_kuro-mar-07-b-ce-id-business-test-6371.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      - client_id       = "2a8d39a5-91ad-4700-99ce-32905ea0de8b" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "idir_userid"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "idir_userid"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "c153faba-d326-4aa4-a4ed-1853765ddbc3" -> null
      - name            = "idir_userid" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth-business" -> null
    }

  # module.keycloak_test.module.onestopauth_business.module.client_kuro-mar-07-b-ce-id-business-test-6371.keycloak_openid_client.this will be destroyed
  - resource "keycloak_openid_client" "this" {
      - access_type                              = "CONFIDENTIAL" -> null
      - client_id                                = "kuro-mar-07-b-ce-id-business-test-6371" -> null
      - client_secret                            = (sensitive value)
      - consent_required                         = false -> null
      - description                              = "CSS App Created" -> null
      - direct_access_grants_enabled             = false -> null
      - enabled                                  = true -> null
      - exclude_session_state_from_auth_response = false -> null
      - full_scope_allowed                       = false -> null
      - id                                       = "2a8d39a5-91ad-4700-99ce-32905ea0de8b" -> null
      - implicit_flow_enabled                    = false -> null
      - name                                     = "kuro-mar-07-b-ce-id-business-test-6371" -> null
      - realm_id                                 = "onestopauth-business" -> null
      - service_accounts_enabled                 = false -> null
      - standard_flow_enabled                    = true -> null
      - valid_redirect_uris                      = [
          - "http://bceidTest.com",
          - "http://testchange.com",
        ] -> null
      - web_origins                              = [] -> null
    }

Plan: 10 to add, 2 to change, 20 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 4260 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*